#!/bin/bash

clear;

echo '================================================================';
echo '开始安装redis集群部署';
echo '================================================================';


echo "配置redis集群..."
/usr/local/bin/redis-cli --cluster create $1:7000 $1:7001 $2:7000 $2:7001 $3:7000 $3:7001 --cluster-replicas 1 -a Jiang13479@
echo "配置完成!"

echo ""
echo "完成集群创建!"
echo ""
echo "测试集群命令: /usr/local/bin/redis-cli -h 127.0.0.1 -p 7000"
echo ""
echo "127.0.0.1:7000>auth Jiang13479@"
echo ""
echo "127.0.0.1:7000>cluster nodes"

echo '================================================================';
echo '完成redis集群部署';
echo '================================================================';
